/**
 *  filename: schema.strings
 *  created : Wed Mar 17 12:43:17 2004
 */

"kMDItemKeywords"                             = "Keywords";
"kMDItemTitle"                                = "Title";
"kMDItemSubject"                              = "Subject";
"kMDItemTheme"                                = "Theme";
"kMDItemAuthors"                              = "Authors";
"kMDItemEditors"                              = "Editors";
"kMDItemProjects"                             = "Projects";
"kMDItemWhereFroms"                           = "Where from";
"kMDItemComment"                              = "Comment";
"kMDItemCopyright"                            = "Copyright";
"kMDItemProducer"                             = "Producer";
"kMDItemUsedDates"                            = "Used dates";
"kMDItemLastUsedDate"                         = "Last opened";
"kMDItemContentCreationDate"                  = "Content created";
"kMDItemContentModificationDate"              = "Content modified";
"kMDItemDurationSeconds"                      = "Duration";
"kMDItemCreationDate"                         = "Item creation";
"kMDItemContactKeywords"                      = "Contact keywords";
"kMDItemVersion"                              = "Version";
"kMDItemPixelHeight"                          = "Pixel height";
"kMDItemPixelWidth"                           = "Pixel width";
"kMDItemPageHeight"                           = "Page height";
"kMDItemPageWidth"                            = "Page width";
"kMDItemColorSpace"                           = "Color space";
"kMDItemBitsPerSample"                        = "Bits per sample";
"kMDItemFlashOnOff"                           = "Flash";
"kMDItemFocalLength"                          = "Focal length";
"kMDItemHasAlphaChannel"                      = "Alpha channel";
"kMDItemAcquisitionMake"                      = "Device make";
"kMDItemAcquisitionModel"                     = "Device model";
"kMDItemISOSpeed"                             = "ISO speed";
"kMDItemOrientation"                          = "Orientation";
"kMDItemLayerNames"                           = "Layers";
"kMDItemWhiteBalance"                         = "White balance";
"kMDItemAperture"                             = "Aperture";
"kMDItemProfileName"                          = "Profile name";
"kMDItemResolutionWidthDPI"                   = "Resolution width";
"kMDItemResolutionHeightDPI"                  = "Resolution height";
"kMDItemExposureMode"                         = "Exposure mode";
"kMDItemExposureTimeSeconds"                  = "Exposure time";
"kMDItemEXIFVersion"                          = "EXIF version";
"kMDItemEXIFGPSVersion"                       = "EXIF GPS version";
"kMDItemCodecs"                               = "Codecs";
"kMDItemMediaTypes"                           = "Media types";
"kMDItemStreamable"                           = "Streamable";
"kMDItemTotalBitRate"                         = "Total bit rate";
"kMDItemVideoBitRate"                         = "Video bit rate";
"kMDItemAudioBitRate"                         = "Audio bit rate";
"kMDItemDeliveryType"                         = "Delivery type";

"kMDItemAltitude"                             = "Altitude";
"kMDItemLatitude"                             = "Latitude";
"kMDItemLongitude"                            = "Longitude";

"kMDItemTextContent"                          = "Text content";
"kMDItemDisplayName"                          = "Display name";
"kMDItemAlternateNames"                       = "Alternate display names";

"kMDItemRedEyeOnOff"                          = "Red eye";
"kMDItemMeteringMode"                         = "Metering mode";
"kMDItemMaxAperture"                          = "Max aperture";
"kMDItemFNumber"                              = "FNumber";
"kMDItemExposureProgram"                      = "Exposure program";
"kMDItemExposureTimeString"                   = "Exposure time";
"kMDItemHeadline"                             = "Headline";
"kMDItemInstructions"                         = "Instructions";
"kMDItemCity"                                 = "City";
"kMDItemStateOrProvince"                      = "State or Province";
"kMDItemCountry"                              = "Country";

"kMDItemAlbum"                                = "Album";
"kMDItemAudioSampleRate"                      = "Sample rate";
"kMDItemAudioChannelCount"                    = "Channel count";
"kMDItemTempo"                                = "Tempo";
"kMDItemKeySignature"                         = "Key signature";
"kMDItemTimeSignature"                        = "Time signature";
"kMDItemAudioEncodingApplication"             = "Audio encoding application";
"kMDItemComposer"                             = "Composer";
"kMDItemLyricist"                             = "Lyricist";
"kMDItemAudioTrackNumber"                     = "Track number";
"kMDItemRecordingDate"                        = "Recording date";
"kMDItemMusicalGenre"                         = "Musical genre";
"kMDItemIsGeneralMIDISequence"                = "General MIDI sequence";
"kMDItemRecipients"                           = "Recipients";
"kMDItemRecordingYear"                        = "Year recorded";

"kMDItemOrganizations"                        = "Organizations";
"kMDItemLanguages"                            = "Languages";
"kMDItemRights"                               = "Rights";
"kMDItemPublishers"                           = "Publishers";
"kMDItemContributors"                         = "Contributors";
"kMDItemCoverage"                             = "Coverage";
"kMDItemDescription"                          = "Description";
"kMDItemIdentifier"                           = "Identifier";
"kMDItemAudiences"                            = "Audiences";

"kMDItemNumberOfPages"                        = "Pages";
"kMDItemSecurityMethod"                       = "Security method";

"kMDItemCreator"                              = "Content Creator";
"kMDItemDueDate"                              = "Due date";
"kMDItemEncodingApplications"                 = "Encoding software";

"kMDItemStarRating"                           = "Rating";
"kMDItemPhoneNumbers"                         = "Phone number";
"kMDItemEmailAddresses"                       = "Email addresses";
"kMDItemInstantMessageAddresses"              = "Instant message addresses";
"kMDItemKind"                                 = "Kind";
"kMDItemURL"                                  = "URL";

"kMDItemRecipientEmailAddresses"              = "Recipient Email addresses";
"kMDItemAuthorEmailAddresses"                 = "Author Email addresses";

/* Names for FS attributes */
"kMDItemFSName"                               = "Filename";
"kMDItemPath"                                 = "File pathname";
"kMDItemFSSize"                               = "Size";
"kMDItemFSCreationDate"                       = "Created";
"kMDItemFSContentChangeDate"                  = "Modified";
"kMDItemFSOwnerUserID"                        = "Owner";
"kMDItemFSOwnerGroupID"                       = "Group";
//"kMDItemFSExists"                             = "File exists";
"kMDItemFSIsReadable"                         = "File readable";
"kMDItemFSIsWriteable"                        = "File writable";
"kMDItemFSNodeCount"                          = "Number of items";
"kMDItemFSHasCustomIcon"                      = "Custom Icon";
"kMDItemFSIsExtensionHidden"                  = "File extension hidden";
"kMDItemFSIsStationery"                       = "Stationery";
"kMDItemFSInvisible"                          = "File invisible";
"kMDItemFSLabel"                              = "File label";

"kMDItemFinderComment"                        = "Spotlight comment";
"kMDItemFonts"                                = "Fonts";

"kMDItemAppleLoopsRootKey"                    = "Loop original key";
"kMDItemAppleLoopsKeyFilterType"              = "Loop scale type";
"kMDItemAppleLoopsLoopMode"                   = "Loop file type";
"kMDItemAppleLoopDescriptors"                 = "Loop descriptors";
"kMDItemMusicalInstrumentCategory"            = "Instrument category";
"kMDItemMusicalInstrumentName"                = "Instrument name";

"kMDItemInformation"                          = "Movie information";
"kMDItemDirector"                             = "Director";
"kMDItemGenre"                                = "Genre";
"kMDItemPerformers"                           = "Performers";
"kMDItemOriginalFormat"                       = "Original Format";
"kMDItemOriginalSource"                       = "Original Source";

/* Attribute Descriptions That will be presented to the user
 *
 * In the form of
 * Attribute.Description
 * "." is not a valid character in an Attribute name.
 */
"kMDItemKeywords.Description"                 = "Keywords associated with this item";
"kMDItemTitle.Description"                    = "Title of this item";
"kMDItemSubject.Description"                  = "Subject of this item";
"kMDItemTheme.Description"                    = "Theme of this item";
"kMDItemAuthors.Description"                  = "Authors of this item";
"kMDItemEditors.Description"                  = "Editors of this item";
"kMDItemProjects.Description"                 = "Projects this item is part of";
"kMDItemWhereFroms.Description"               = "Where the item came from";
"kMDItemComment.Description"                  = "Comments about this item";
"kMDItemCopyright.Description"                = "Copyright information about this item";
"kMDItemProducer.Description"                 = "Producer of this item";
"kMDItemUsedDates.Description"                = "Dates when this item was used";
"kMDItemLastUsedDate.Description"             = "Date when this item was last used";
"kMDItemContentCreationDate.Description"      = "Date when the content of this item was created";
"kMDItemContentModificationDate.Description"  = "Date when the content of this item was modified";
"kMDItemDurationSeconds.Description"          = "Duration of this item in seconds";
"kMDItemCreationDate.Description"             = "Date when this item was created";
"kMDItemContactKeywords.Description"          = "Contacts associated with this item";
"kMDItemVersion.Description"                  = "Version number of this item";

"kMDItemPixelHeight.Description"              = "Height of the document in pixels";
"kMDItemPixelWidth.Description"               = "Width of the document in pixels";
"kMDItemPageHeight.Description"               = "Height of the document page in points";
"kMDItemPageWidth.Description"                = "Width of the document page in points";
"kMDItemResolutionWidthDPI.Description"       = "Resolution width of this image in DPI";
"kMDItemResolutionHeightDPI.Description"      = "Resolution height of this image in DPI";

"kMDItemColorSpace.Description"               = "Color space model of this image";
"kMDItemProfileName.Description"              = "Name of the color profile used for the image";

"kMDItemBitsPerSample.Description"            = "Number of bits per sample";
"kMDItemFlashOnOff.Description"               = "Whether the picture was taken using a flash";
"kMDItemFocalLength.Description"              = "Focal length of the lens in millimeters (mm)";
"kMDItemHasAlphaChannel.Description"          = "Whether the image has an Alpha channel";
"kMDItemAcquisitionMake.Description"          = "Make of the device used to acquire this document";
"kMDItemAcquisitionModel.Description"         = "Model of the device was used to acquire this document";
"kMDItemISOSpeed.Description"                 = "ISO speed of the camera when the picture was taken";
"kMDItemOrientation.Description"              = "Orientation  of the picture (landscape or portrait)";
"kMDItemLayerNames.Description"               = "Names of the layers in the file";
"kMDItemWhiteBalance.Description"             = "White balance setting of the camera when the picture was taken.";
"kMDItemAperture.Description"                 = "Aperture setting of the camera when the picture was taken";
"kMDItemExposureMode.Description"             = "Mode used for the exposure";
"kMDItemExposureTimeSeconds.Description"      = "Time the lens was open during exposure";
"kMDItemEXIFVersion.Description"              = "Version of EXIF used to generate the metadata";
"kMDItemEXIFGPSVersion.Description"           = "The version of GPSInfoIFD in EXIF used to generate the metadata";
"kMDItemRedEyeOnOff.Description"              = "Whether 'red eye' correction was on or off";
"kMDItemMeteringMode.Description"             = "The metering mode (Unknown, Average, CenterWeightedAverage, Spot, MultiSpot, Pattern, Partial)";
"kMDItemMaxAperture.Description"              = "Smallest F number of the lens in APEX value units, usually in the range of 00.00 to 99.99";
"kMDItemFNumber.Description"                  = "Diameter of the aperture relative to the effective focal length of the lens";
"kMDItemExposureProgram.Description"          = "Type of program used by the camera to set the exposure: Manual, Normal, Aperture priority, ...";
"kMDItemExposureTimeString.Description"       = "Exposure time";
"kMDItemHeadline.Description"                 = "Publishable summary of the contents of the item";
"kMDItemInstructions.Description"             = "Other information concerning the item, such as handling instructions";
"kMDItemCity.Description"                     = "City of the item";
"kMDItemStateOrProvince.Description"          = "State or province of the item according to the provider";
"kMDItemCountry.Description"                  = "Country or location where the item was created according to the provider";

"kMDItemAltitude.Description"                 = "The altitude of the item in meters above sea level, expressed using the WGS84 datum.  Negative values lie below sea level.";
"kMDItemLatitude.Description"                 = "The latitude of the item in degrees north of the equator, expressed using the WGS84 datum.  Negative values lie south of the equator.";
"kMDItemLongitude.Description"                = "The longitude of the item in degrees east of the prime meridian, expressed using the WGS84 datum.  Negative values lie west of the prime meridian.";

"kMDItemCodecs.Description"                   = "Codecs used to encode and decode the media";
"kMDItemMediaTypes.Description"               = "Media types present in the content";
"kMDItemStreamable.Description"               = "Whether the content is prepared for streaming";
"kMDItemTotalBitRate.Description"             = "Combined bit rate of the audio and video in the media";
"kMDItemVideoBitRate.Description"             = "Bit rate of the video in the media";
"kMDItemAudioBitRate.Description"             = "Bit rate of the audio in the media";
"kMDItemDeliveryType.Description"             = "Method used to deliver the media (Fast Start or RTSP)";
"kMDItemDisplayName.Description"              = "Localized name of the file";
"kMDItemAlternateNames.Description"           = "Alternate names of the file";
"kMDItemAlbum.Description"                    = "Title for a collection of media, such as a record album";
"kMDItemAudioSampleRate.Description"          = "Sample rate of the file\'s audio data";
"kMDItemAudioChannelCount.Description"        = "Number of channels in the file\'s audio data";
"kMDItemTempo.Description"                    = "Tempo of the music in the audio file in Beats Per Minute";
"kMDItemKeySignature.Description"             = "Musical key of the song in the audio file";
"kMDItemTimeSignature.Description"            = "Time signature of the song in the audio or MIDI file";
"kMDItemAudioEncodingApplication.Description" = "Name of the application that encoded the data in the audio file";
"kMDItemComposer.Description"                 = "Composer of the song in the audio file";
"kMDItemLyricist.Description"                 = "Lyricist of the song in the audio file";
"kMDItemAudioTrackNumber.Description"         = "Track number of the song that is part of an album";
"kMDItemRecordingDate.Description"            = "Date the song was recorded";
"kMDItemMusicalGenre.Description"             = "Musical genre of the song in the audio file";
"kMDItemIsGeneralMIDISequence.Description"    = "Whether the MIDI sequence contained in the file is setup for use with a General MIDI device";
"kMDItemRecordingYear.Description"            = "Year the item was recorded";

"kMDItemOrganizations.Description"            = "Organizations that created the document";
"kMDItemLanguages.Description"                = "Languages of the content of the document";
"kMDItemRights.Description"                   = "Link to information about the rights held on the document";
"kMDItemPublishers.Description"               = "Publisher of the document";
"kMDItemContributors.Description"             = "People or organizations contributing to the content of the document";
"kMDItemCoverage.Description"                 = "Extent or scope of the content of the document";
"kMDItemDescription.Description"              = "Description of the content of the document";
"kMDItemIdentifier.Description"               = "Reference to a resource within a given context";
"kMDItemAudiences.Description"                = "Who the document is intended for";

"kMDItemNumberOfPages.Description"            = "Number of pages in the document";
"kMDItemSecurityMethod.Description"           = "Encryption method used to make the document secure";
"kMDItemCreator.Description"                  = "Application used to create the document";
"kMDItemEncodingApplications.Description"     = "Software used to convert the original content";
"kMDItemDueDate.Description"                  = "Date this item is due";

"kMDItemStarRating.Description"               = "User Rating";
"kMDItemPhoneNumbers.Description"             = "Phone numbers associated with this item";
"kMDItemEmailAddresses.Description"           = "Email addresses associated with this item";
"kMDItemInstantMessageAddresses.Description"  = "Instant message addresses associated with this item";
"kMDItemKind.Description"                     = "Kind of this item";
"kMDItemFinderComment.Description"            = "Spotlight comment for this item";
"kMDItemTextContent.Description"              = "Text content of this item";
"kMDItemRecipients.Description"               = "Recipients of this item";
"kMDItemFonts.Description"                    = "Fonts used in this item";
"kMDItemURL.Description"                      = "URL of this item";
"kMDItemRecipientEmailAddresses.Description"  = "Email addresses for recipients of this item";
"kMDItemAuthorEmailAddresses.Description"     = "Email addresses for authors of this item";

"kMDItemInformation.Description"              = "Movie information";
"kMDItemDirector.Description"                 = "Director";
"kMDItemGenre.Description"                    = "Genre";
"kMDItemPerformers.Description"               = "Performers";
"kMDItemOriginalFormat.Description"           = "Original Format";
"kMDItemOriginalSource.Description"           = "Original Source";

"kMDItemFSName.Description"                   = "Name of the file";
"kMDItemPath.Description"                     = "Complete pathname of this file";
"kMDItemFSSize.Description"                   = "Size of the file on disk in bytes, rounded to the block size of the disk";
"kMDItemFSCreationDate.Description"           = "Date the file was created";
"kMDItemFSContentChangeDate.Description"      = "Date the file content was last changed";
"kMDItemFSOwnerUserID.Description"            = "User ID of the owner of the file";
"kMDItemFSOwnerGroupID.Description"           = "Group ID of owner of the file";
"kMDItemFSIsReadable.Description"             = "Whether the file can be opened but not changed";
"kMDItemFSIsWriteable.Description"            = "Whether the file can be changed";
"kMDItemFSNodeCount.Description"              = "Number of files and folders in the folder";
"kMDItemFSHasCustomIcon.Description"          = "Whether the file has a custom icon";
"kMDItemFSIsExtensionHidden.Description"      = "Whether the file extension is hidden";
"kMDItemFSIsStationery.Description"           = "Whether the file is stationery";
"kMDItemFSInvisible.Description"              = "Whether the file is visible";
"kMDItemFSLabel.Description"                  = "Number corresponding to the Finder label assigned to the file";

"kMDItemAppleLoopsRootKey.Description"        = "Shows the loop's original key. The key is the root note or tonic for the loop, and does not include the scale type";
"kMDItemAppleLoopsKeyFilterType.Description"  = "Whether the loop uses the major or minor scale, neither scale, or can be used with both";
"kMDItemAppleLoopsLoopMode.Description"       = "Whether the file is a looping or non-looping file. Looping files adjust their tempo to the song tempo, while non-looping files keep their recorded tempo";
"kMDItemAppleLoopDescriptors.Description"     = "Keywords describing the mood and other aspects of the loop";
"kMDItemMusicalInstrumentCategory.Description"= "Instrument category to which the file belongs";
"kMDItemMusicalInstrumentName.Description"    = "Type of instrument the file recorded in the file";


/* Attribute short names That will be presented to the user
 *
 * In the form of
 * Attribute.ShortName
 * "." is not a valid character in an Attribute name.
 * These strings should all be sort and 1 word with no spaces in them.
 */
"kMDItemKeywords.ShortName"                   = "keyword";
"kMDItemTitle.ShortName"                      = "title";
"kMDItemSubject.ShortName"                    = "subject,title";
"kMDItemTheme.ShortName"                      = "theme";
"kMDItemAuthors.ShortName"                    = "author,from,with,by";
"kMDItemEditors.ShortName"                    = "editor";
"kMDItemProject.ShortName"                    = "project";
"kMDItemWhereFroms.ShortName"                 = "wherefrom";
"kMDItemComment.ShortName"                    = "comment";
"kMDItemCopyright.ShortName"                  = "copyright";
"kMDItemProducer.ShortName"                   = "producer";
"kMDItemUsedDates.ShortName"                  = "used,date";
"kMDItemLastUsedDate.ShortName"               = "lastused,date";
"kMDItemContentCreationDate.ShortName"        = "contentcreated,created,date";
"kMDItemContentModificationDate.ShortName"    = "contentmodified,modified,date";
"kMDItemDurationSeconds.ShortName"            = "duration,time";
"kMDItemCreationDate.ShortName"               = "itemcreated,created,date";
"kMDItemContactKeywords.ShortName"            = "contactkeyword,keyword";
"kMDItemVersion.ShortName"                    = "version";
"kMDItemPixelHeight.ShortName"                = "pixelheight,height";
"kMDItemPixelWidth.ShortName"                 = "pixelwidth,width";
"kMDItemPageHeight.ShortName"                 = "pageheight,height";
"kMDItemPageWidth.ShortName"                  = "pagewidth,height";
"kMDItemColorSpace.ShortName"                 = "colorspace";
"kMDItemBitsPerSample.ShortName"              = "bitspersample,bps";
"kMDItemFlashOnOff.ShortName"                 = "flash";
"kMDItemFocalLength.ShortName"                = "focallength";
"kMDItemHasAlphaChannel.ShortName"            = "alpha";
"kMDItemAcquisitionMake.ShortName"            = "make";
"kMDItemAcquisitionModel.ShortName"           = "model";
"kMDItemISOSpeed.ShortName"                   = "iso";
"kMDItemOrientation.ShortName"                = "orientation";
"kMDItemLayerNames.ShortName"                 = "layer";
"kMDItemWhiteBalance.ShortName"               = "whitebalance";
"kMDItemAperture.ShortName"                   = "aperture,fstop";
"kMDItemProfileName.ShortName"                = "profile";
"kMDItemResolutionWidthDPI.ShortName"         = "widthdpi,dpi";
"kMDItemResolutionHeightDPI.ShortName"        = "heightdpi,dpi";
"kMDItemExposureMode.ShortName"               = "exposuremode";
"kMDItemExposureTimeSeconds.ShortName"        = "exposuretime,time";
"kMDItemEXIFVersion.ShortName"                = "exifversion";
"kMDItemCodecs.ShortName"                     = "codec";
"kMDItemMediaTypes.ShortName"                 = "mediatype";
"kMDItemStreamable.ShortName"                 = "streamable";
"kMDItemTotalBitRate.ShortName"               = "totalbitrate,bitrate";
"kMDItemVideoBitRate.ShortName"               = "videobitrate,bitrate";
"kMDItemAudioBitRate.ShortName"               = "audiobitrate,bitrate";
"kMDItemDeliveryType.ShortName"               = "delivery";
"kMDItemAltitude.ShortName"                   = "altitude";
"kMDItemLatitude.ShortName"                   = "latitude";
"kMDItemLongitude.ShortName"                  = "longitude";

"kMDItemTextContent.ShortName"                = "intext";
"kMDItemDisplayName.ShortName"                = "displayname,name";

"kMDItemRedEyeOnOff.ShortName"                = "redeye";
"kMDItemMeteringMode.ShortName"               = "meteringmode";
"kMDItemMaxAperture.ShortName"                = "maxaperture";
"kMDItemFNumber.ShortName"                    = "fnumber,fstop";
"kMDItemExposureProgram.ShortName"            = "exposureprogram";
"kMDItemExposureTimeString.ShortName"         = "exposuretime,time";
"kMDItemHeadline.ShortName"                   = "headline,title";
"kMDItemInstructions.ShortName"               = "instructions";
"kMDItemCity.ShortName"                       = "city";
"kMDItemStateOrProvince.ShortName"            = "state,province";
"kMDItemCountry.ShortName"                    = "country";

"kMDItemAlbum.ShortName"                      = "album,title";
"kMDItemAudioSampleRate.ShortName"            = "audiosamplerate,samplerate";
"kMDItemAudioChannelCount.ShortName"          = "channels";
"kMDItemTempo.ShortName"                      = "tempo";
"kMDItemKeySignature.ShortName"               = "keysignature,key";
"kMDItemTimeSignature.ShortName"              = "timesignature";
"kMDItemAudioEncodingApplication.ShortName"   = "audioencodingapplication";
"kMDItemComposer.ShortName"                   = "composer,author,by";
"kMDItemLyricist.ShortName"                   = "lyricist,author,by";
"kMDItemAudioTrackNumber.ShortName"           = "tracknumber";
"kMDItemRecordingDate.ShortName"              = "recordingdate,date";
"kMDItemMusicalGenre.ShortName"               = "musicalgenre,genre";
"kMDItemIsGeneralMIDISequence.ShortName"      = "ismidi";
"kMDItemRecipients.ShortName"                 = "recipient,to,with";
"kMDItemRecordingYear.ShortName"              = "yearrecorded,year";

"kMDItemOrganizations.ShortName"              = "organization";
"kMDItemLanguages.ShortName"                  = "language";
"kMDItemRights.ShortName"                     = "rights";
"kMDItemPublishers.ShortName"                 = "publisher";
"kMDItemContributors.ShortName"               = "contributor,by,author,with";
"kMDItemCoverage.ShortName"                   = "coverage";
"kMDItemDescription.ShortName"                = "description,comment";
"kMDItemIdentifier.ShortName"                 = "id";
"kMDItemAudiences.ShortName"                  = "audience,to";

"kMDItemNumberOfPages.ShortName"              = "pages";
"kMDItemSecurityMethod.ShortName"             = "securitymethod";

"kMDItemCreator.ShortName"                    = "creator";
"kMDItemDueDate.ShortName"                    = "duedate,date";
"kMDItemEncodingApplications.ShortName"       = "encodingapplication";

"kMDItemStarRating.ShortName"                 = "starrating";
"kMDItemPhoneNumbers.ShortName"               = "phonenumber";
"kMDItemEmailAddresses.ShortName"             = "email";
"kMDItemInstantMessageAddresses.ShortName"    = "imname";
"kMDItemKind.ShortName"                       = "kind";
"kMDItemURL.ShortName"                        = "url";
"kMDItemRecipientEmailAddresses.ShortName"    = "email,to";
"kMDItemAuthorEmailAddresses.ShortName"       = "email,from";

/* Names for FS attributes */
"kMDItemFSName.ShortName"                     = "filename";
"kMDItemPath.ShortName"                       = "path";
"kMDItemFSSize.ShortName"                     = "size";
"kMDItemFSCreationDate.ShortName"             = "created";
"kMDItemFSContentChangeDate.ShortName"        = "modified";
"kMDItemFSOwnerUserID.ShortName"              = "owner";
"kMDItemFSOwnerGroupID.ShortName"             = "group";
"kMDItemFSIsStationery.ShortName"             = "stationery";
"kMDItemFSInvisible.ShortName"                = "invisible";
"kMDItemFSLabel.ShortName"                    = "label";

"kMDItemFinderComment.ShortName"              = "spotlightcomment,comment";
"kMDItemFonts.ShortName"                      = "font";

"kMDItemMusicalInstrumentCategory.ShortName"  = "instrumentcategory";
"kMDItemMusicalInstrumentName.ShortName"      = "instrumentname";
